package com.company;
import java.util.Scanner;
public class Main {
    Scanner in = new Scanner(System.in);

        public static void main(String[] args)
        {
            Books[] book = new Books[8]; //Объекты класса "Books"
            cl_essence[] essence = new cl_essence[8]; //Объекты дочернего класса "Books" - "cl_essence"
//(String writer, String title, byte chapters, int pages, String about_book, double minval)
            book[0] = new Books("Толкин", "Властелин колец", 52, 1184, "Экзамен: Назвать всех 9 членов Братства Кольца.", 78);
            book[1] = new Books("Толкин", "Сильмариллион", 22, 432, "Предыстория 'Властелин колец'.", 78);
            book[2] = new Books("Ницше", "Так говорил Заратустра", 18, 576, "Ходит Заратустра... Ищет Сверхчеловека... В итоге на бедняка наступил, вот растяпа!", 55);
            book[3] = new Books("Сунь Цзи", "Исскуство войны", 15, 224, "Вводи шпионов в город своего врага.. Ставь лучников на возвышенность... Будь мудр...", (999.99));
            book[4] = new Books("Карнеги", "Искусство завоевывать друзей и воздействовать на людей", 30, 352, "Помнишь образ Франка Синатры? Будь как Синатра!", 205);
            book[5] = new Books("Кинзи", "Пролетая над гнездом кукушки", 40, 384, "Сестра! В буйный этого острого! Неси мискалин!", 176);
            book[6] = new Books("Велеслав", "Славянская Книга Мёртвых", 24, 420, "Погребальная культура Славян", 710);
            book[7] = new Books("Сунь Цзи", "Исскуство войны", 13, 110, "Всё еще ставь лучников на возвышенность, но теперь дешевле.", 120);
          //  book[8] = new Books();
           // book[9] = new Books();

        }
}
